tests/cases/parallelMassBudget/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class "volScalarField";
    object T;
}
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform 503.15;
    }

    vent
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    walls
    {
        type            fixedValue;
        value           uniform 313.15;
    }
}
